<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b45feb6f8a69e08577f9e0adcde7ccae28ca904becb10c6963e14347e2391bb8","plan_job_ref":"Job Run Terraform plan in staging #289 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/15539023695","plan_out_hash":"9b1fa2c8e0d314385fae0ff58484b9ab5ff5c4a3b361d8210856f0d45e0d190a","plan_hash":"e06a9004b7258ca6858425e68ec25c53ddf0263b8565725158d5433331fc3e58","plan_text_format":"diff","version":"2.0.1","closed":true} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous-monitoring-staging.app.cloud.gov" -> null
            },
-           {
-               protocol = "http1" -> null
-               route    = "rca-test.fr.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "1eEsFmP2+mAIIGKcYHUGPanHamAdxH0h4jxNH+fE03A=" -> "eouEZc9msohN/3XuodtRhj5PL5dQfVpSSEuzqBXc4IA="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-09T13:16:03Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "93b25e7e-b8b8-45f6-b2f0-a30bb081f0b4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d95e9c29-36f0-40e3-b638-883317fe5200"
!~      updated_at   = "2025-05-09T16:45:34Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Deploy Staging #115](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/15539113379)